"""
    集合是无序可变，元素不能重复。
    实际上，集合底层是字典实现，集合的所有元素都是字典中的“键对象”，因此是不能重复的且唯一的。
"""

"""集合创建和删除"""
a = {3, 5, 7}
a.add(9)
# {9, 3, 5, 7}
print(a)

"""使用set()，将列表、元组等可迭代对象转成集合"""
a = ['a','b','c','b']
b = set(a)
{'a', 'c', 'b'}
print(b)

""" remove()删除指定元素； clear()清空整个集合"""
a = {10,20,30,40,50}
a.remove(20)
# {50, 40, 10, 30}
print(a)

"""
    Python对集合也提供了并集、交集、差集等运算。
"""
a = {10, 20, 30}
b = {100, 20 , 300}
c = a.union(b)
# 并集 {20, 100, 10, 300, 30}
print(c)
cc = a.intersection(b)
# 交集 {20}
print(cc)
ccc = a.difference(b)
# 差集 {10, 30}
print(ccc)