"""
  Python程序由模块组成。一个模块对应python源文件，一般后缀名是： .py
    模块由语句组成。运行Python程序时，按照模块中语句的顺序依次执行
    语句是Python程序的构造单元，用于创建对象、变量赋值、调用函数、控制语句等

模块也分为标准库模块和用户自定义模块
   （1）标准库模块(standard library)
    Python标准库提供了操作系统功能、网络通信、文本处理、文件处 理、数学运算等基本的功能。比如：random(随机数)、 math(数学 运算)、time(时间处理)、file(文件处理)、os(和操作系统交互)、
sys(和解释器交互)等。
    Python还提供了海量的第三方模块，使用方式和标准库类    似。功能覆盖了我们能想象到的所有领域，比如：科学计算、  WEB
开发、大数据、人工智能、图形系统等。
    (2)

模块化编程有如下几个重要优势：
    (1)便于将一个任务分解成多个模块，实现团队协同开发，完成大规模程序
    (2)实现代码复用。  一个模块实现后，可以被反复调用
    (3)可维护性增强

"""