"""
 函数的参数传递本质：从实参到形参的赋值操作
 python中参数的传递都是"引用传递"，不是"值传递"

  可变对象有：
    字典、列表、集合、自定义的对象等
  不可变对象有：
    数字、字符串、元组、function等
"""

""" 参数传递：传递可变对象的引用"""
b = [10, 20]
def f2(m):
    print("m:", id(m))
    m.append(30)

# m: 4338844544
f2(b)
# b: 4338844544
print("b:", id(b))
# [10, 20, 30]
print(b)

""" 参数传递：传递不可变对象的引用 """
a = 100
def f1(n):
    # n: 4305800528 传递进来的是a对象的地址
    print("n:", id(n))
    n = n + 200 # 由于a为不可变对象，因此创建新的对象n
    # n: 4305812368
    print("n:", id(n))
    # 300
    print(n)

f1(a)
# a: 4307062096
print("a:", id(a))
