"""
    一个循环体内可以嵌入另一个循环， 一般称为“嵌套循环”，或者“多重循环”。
"""

"""
打印如下图案
    0	0	0	0	0	
    1	1	1	1	1	
    2	2	2	2	2	
    3	3	3	3	3	
    4	4	4	4	4	
"""
for x in range(5):
    for y in range(5):
            print(x, end="\t")
    print()

"""
    利用嵌套循环打印九九乘法表
    1*1=1	
    2*1=2	2*2=4	
    3*1=3	3*2=6	3*3=9	
    4*1=4	4*2=8	4*3=12	4*4=16	
    5*1=5	5*2=10	5*3=15	5*4=20	5*5=25	
    6*1=6	6*2=12	6*3=18	6*4=24	6*5=30	6*6=36	
    7*1=7	7*2=14	7*3=21	7*4=28	7*5=35	7*6=42	7*7=49	
    8*1=8	8*2=16	8*3=24	8*4=32	8*5=40	8*6=48	8*7=56	8*8=64	
    9*1=9	9*2=18	9*3=27	9*4=36	9*5=45	9*6=54	9*7=63	9*8=72	9*9=81	
"""
for m in range(1, 10):
    for n in range(1, m+1):
            print("{0}*{1}={2}".format(m,n,(m*n)), end="\t")
    # 进行换行
    print()

"""
    用列表和字典存储下表信息，并打印出表中工资高于15000的数据
"""
r1= dict(name="林大侠",age=18,salary=30000,city="北京")
r2= dict(name="林二侠",age=19,salary=20000,city="上海")
r3= dict(name="林三侠",age=20,salary=10000,city="深圳")
# 定时列表
tb = [r1,r2,r3]

for x in tb:
    if x.get("salary") > 15000:
        """
        {'name': '林大侠', 'age': 18, 'salary': 30000, 'city': '北京'}
        {'name': '林二侠', 'age': 19, 'salary': 20000, 'city': '上海'}
        """
        print(x)